Revit 2027 API
ParameterTypeId.PreferPatternAlignUiFilter Property
 "Pattern:": This is used by the UI to allow to select the preferred preference of aligning pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PreferPatternAlignUiFilter { get; }
Public Shared ReadOnly Property PreferPatternAlignUiFilter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PreferPatternAlignUiFilter {
	ForgeTypeId^ get ();
}
static member PreferPatternAlignUiFilter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace